# Python for Data Analysts and Data Scientists

## Important concepts


- **Accuracy:** How close you are to the actual value you're looking for.   
- **Precision:** How reproducible and repeatible is your algorithm.

## What is Data?  

Any type of information, any piece of information.  



![](https://www.researchgate.net/profile/Jorge-Cardoso-14/publication/236860222/figure/fig4/AS:669293989593114@1536583530877/Unstructured-semi-structured-and-structured-data.png)

## What is an Algorithm?  

Series of steps you take in order to accomplish a task.

## What is Data Science?  
In order to understan what Data Science is, first we need to undertand what Science is. **Science** in the knowledge or a system of knowledge especially as obtained and tested through **scientific method**. **Data Science** then is the sciences that uses data to drive conclusions using the scientific method.  
It is very improtant to have in mind that part of the scientific method consist in testing Hypothesis but also in refusing Hipothesis.

## What is Machine Learning?
Machine learning is a tool of Artificial intelligence that gives the machines the ability of lean wihtout being explicitly  programmed. Before **ML** (Machine learning), we had to explicitly define all possible actiones that the machine should take given a specific situation.  
ML is often used when traditional statistic can not deal with a task, or when the amough of variables and/or data is massive.   


There are many uses for ML, such as:

* Prediction, like forcasting demand or prices changes.
* Image recognition, like face detection.
* Medical diagnoses, such as the ability to recognize cancerous tissues or anomalies in medical images. 
* Finance, performing fraud investigations and credit checks.

## What is Artificial Intelligence?
Artificial intelligence, or AI for short, has been a field of study since the 1950â€™s. Popularity has increased recently because of the advancements in computing power.

But what is artificial intelligence? AI is the ability to enable computers to understand data, learn from the data, and make decisions based on patterns hidden in the data. This sounds a lot like Machine Learning. In fact, machine learning tools are implementations of AI. These ML tools perform tasks that could otherwise be very difficult, if not impossible, for humans to perform manually.

# Data Frame Manipulation with `pandas`

`pandas` stands for "Python Data Analysis".  
`pandas` should not be used to manipulate huge datasets due to the fact that it uses the RAM memory to operate. 
That being said, `pandas` is a library/package that allows you to work with `DataFrames` that are multidimentional arrays that are easy to work with and have labels for rows and columns. 
At the core of the ```pandas``` library are two fundamental data structures/objects:
1. [Series](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html)
2. [DataFrame](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html)

A **```Series```** object stores single-column data along with an **index**. An index is just a way of "numbering" the ```Series``` object.

A **```DataFrame```** object is a two-dimensional tabular data structure with labeled axes.

## Loading Data into ```pandas``` , ``pandas`` , `pandas`

The most common daty type is a CSV file. This is a plane text that is ussually separated with comas but can also be separated with other characters such as semicolons or tabs.
For example:  



Animal,Type,Colour  
Cow,Farm,White  
Cat,House,Black  
Koala,Wildlife,Grey

~~~python
import pandas as pd
pd.read_csv("path/to/file.csv")
~~~

In [9]:
import pandas as pd
df = pd.read_csv("Data/watches.csv")

### Visualising the DataFrame

We can check the first rows using [**`.head()`**](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.head.html) and see the last ones with [**`.tail()`**](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.tail.html):

In [10]:
df.head()

            model              store condition  engagement  price
0         Caracal  Watches unlimited       New   77.848101  489.0
1         Caracal   National traders  Like new   75.696203  489.0
2         Caracal   National traders      Good   72.025316  490.5
3  Lightning bolt        Super deals  Like new   78.987342  501.0
4            Sand        Super deals      Good   80.126582  502.5

### Accesing to a sigle column

In [11]:
df['model']

0            Caracal
1            Caracal
2            Caracal
3     Lightning bolt
4               Sand
           ...
70    Lightning bolt
71              Sand
72    Lightning bolt
73              Sand
74             Tempo
Name: model, Length: 75, dtype: object

### Accesing to a multiple columns

In [14]:
df[["model", "store", "condition"]]

             model              store  condition
0          Caracal  Watches unlimited        New
1          Caracal   National traders   Like new
2          Caracal   National traders       Good
3   Lightning bolt        Super deals   Like new
4             Sand        Super deals       Good
..             ...                ...        ...
70  Lightning bolt   National traders  Very Good
71            Sand   National traders       Good
72  Lightning bolt  Watches unlimited       Fair
73            Sand        Super deals   Like new
74           Tempo  Watches unlimited       Good

[75 rows x 3 columns]

###Â Indexing

By default pandas gives an index from 0 to the rows, but one can change that and use some factor of categorical (sometimes numerical) columns as indexes or group of indexes.

In [31]:
df.set_index(["model", "store", "condition"])   # this only shows but doesn' store anything.

                                            engagement   price
model          store             condition
Caracal        Watches unlimited New         77.848101   489.0
               National traders  Like new    75.696203   489.0
                                 Good        72.025316   490.5
Lightning bolt Super deals       Like new    78.987342   501.0
Sand           Super deals       Good        80.126582   502.5
...                                                ...     ...
Lightning bolt National traders  Very Good   80.379747  4239.0
Sand           National traders  Good        80.506329  4282.5
Lightning bolt Watches unlimited Fair        67.088608  4284.0
Sand           Super deals       Like new    79.493671   835.5
Tempo          Watches unlimited Good        82.405063  4308.0

[75 rows x 2 columns]

### Getting rows

In [60]:
df.loc[1:3]    #Always for explicit index

            model             store condition  engagement  price
1         Caracal  National traders  Like new   75.696203  489.0
2         Caracal  National traders      Good   72.025316  490.5
3  Lightning bolt       Super deals  Like new   78.987342  501.0

In [61]:
df.iloc[1:3]           #Always for implicit index

     model             store condition  engagement  price
1  Caracal  National traders  Like new   75.696203  489.0
2  Caracal  National traders      Good   72.025316  490.5

In [97]:
df[2:10]   # we can also extract rows this way

            model              store  condition  engagement  price
2         Caracal   National traders       Good   72.025316  490.5
3  Lightning bolt        Super deals   Like new   78.987342  501.0
4            Sand        Super deals       Good   80.126582  502.5
5            Sand   National traders  Very Good   79.493671  504.0
6  Lightning bolt  Watches unlimited  Very Good   78.860759  504.0
7       Clepsydra   National traders  Very Good   78.354430  505.5
8         Caracal        Super deals       Fair   82.405063  505.5
9            Sand  Watches unlimited        New   79.493671  510.0

In [110]:
#we can filter by giving a indication
df[df.price > 4000].tail()

             model              store  condition  engagement   price
69            Sand  Watches unlimited       Good   81.012658  4233.0
70  Lightning bolt   National traders  Very Good   80.379747  4239.0
71            Sand   National traders       Good   80.506329  4282.5
72  Lightning bolt  Watches unlimited       Fair   67.088608  4284.0
74           Tempo  Watches unlimited       Good   82.405063  4308.0

### Displaying the index

In [62]:
df.index

RangeIndex(start=0, stop=75, step=1)

### Displaying the name of the variables

In [63]:
df.columns

Index(['model', 'store', 'condition', 'engagement', 'price'], dtype='object')

### Displaying the shape of the DataFrame

In [64]:
df.shape       #first name is the numbers of rows and the second is the number of columns.

(75, 5)

### Displaying the info of the variables of the DataFrame

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 75 entries, 0 to 74
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   model       75 non-null     object
 1   store       75 non-null     object
 2   condition   75 non-null     object
 3   engagement  75 non-null     float64
 4   price       75 non-null     float64
dtypes: float64(2), object(3)
memory usage: 3.1+ KB

## Grouping the Data

Groupping is a common task in Data Science. You can group your data and then display some interesting statistical values of the groups you have created. For example groupping by sex and display the count of how many men and women there are. 
Somo of the functions you can apply are: 
 
-   **count()**	: Returns count for each group
-   **size()**	: Returns size for each group
-   **sum()**	: Returns total sum for each group
-   **mean()**	: Returns mean for each group. Same as average()
-   **average()**	: Returns average for each group. Same as mean()
-   **std()**	: Returns standard deviation for each group
-   **var()**	: Return var for each group
-   **sem()**	: Standard error of the mean of groups
-   **describe()**	: Returns different statistics
-   **min()**	: Returns minimum value for each group
-   **max()**	: Returns maximum value for each group
-   **first()**	: Returns first value for each group
-   **last()**	: Returns last value for each group
-   **nth()**	: Returns nth value for each group

In [78]:
groups = df.groupby(["model", "condition"]) # Grouping by
groups["price"].mean() # You first slice using ["price"] and then call the mean function on the grouped Series
# The object here is a Grouped DataFrame

model           condition
Caracal         Fair         2949.5
                Good         1744.0
                Like new      508.0
                New          1818.5
                Very Good    1832.5
Clepsydra       Fair         4151.5
                Good          604.0
                Like new     1934.0
                New          4162.5
                Very Good    1737.0
Lightning bolt  Fair         4235.5
                Good          655.0
                Like new     1739.5
                New           652.5
                Very Good    1783.5
Sand            Fair         4207.5
                Good         3006.0
                Like new     1884.5
                New           543.5
                Very Good     520.0
Tempo           Fair         4189.5
                Good         4225.5
                Like new     3039.5
                New          2965.0
                Very Good    1854.5
Name: price, dtype: float64

Another way of using the group_by

In [82]:
df.groupby(["model",]).agg({'price':['mean','var','min','max']}) # Group_by model and condition un showing the var and mean of the price
# The object here is a actual DataFrame

                 price
                  mean           var    min     max
model
Caracal         1770.5  3.048256e+06  489.0  4207.5
Clepsydra       2517.8  3.299022e+06  505.5  4195.5
Lightning bolt  1813.2  3.129486e+06  501.0  4284.0
Sand            2032.3  3.440414e+06  502.5  4282.5
Tempo           3254.8  2.551717e+06  531.0  4308.0

### Pivoting

Pivoting is symilar to groupby, however the way of displaying the results is differemt. By pivoting we are able to see a variable(s) in columns and another variable(s) in the rows.  

We create pivot tables in `pandas` using the [**`.pivot_table()`**](https://pandas.pydata.org/docs/reference/api/pandas.pivot_table.html) method, with this syntax:

~~~python
pd.pivot_table(my_df, values=["numeric_column"], index=["row_variable"], columns=["column_variable"])
~~~

In [86]:
pd.pivot_table(df, values=["price"], index=["model"], columns=["condition"]) #by default is the mean

                 price
condition         Fair    Good Like new     New Very Good
model
Caracal         2949.5  1744.0    508.0  1818.5    1832.5
Clepsydra       4151.5   604.0   1934.0  4162.5    1737.0
Lightning bolt  4235.5   655.0   1739.5   652.5    1783.5
Sand            4207.5  3006.0   1884.5   543.5     520.0
Tempo           4189.5  4225.5   3039.5  2965.0    1854.5

In [95]:
pd.pivot_table(df, values=["price"], index=["model"], columns=["store"],aggfunc='count') 
#we can change to another aggregation function

                          price
store          National traders Super deals Watches unlimited
model
Caracal                       5           5                 5
Clepsydra                     5           5                 5
Lightning bolt                5           5                 5
Sand                          5           5                 5
Tempo                         5           5                 5

            model              store  condition  engagement  price
2         Caracal   National traders       Good   72.025316  490.5
3  Lightning bolt        Super deals   Like new   78.987342  501.0
4            Sand        Super deals       Good   80.126582  502.5
5            Sand   National traders  Very Good   79.493671  504.0
6  Lightning bolt  Watches unlimited  Very Good   78.860759  504.0
7       Clepsydra   National traders  Very Good   78.354430  505.5
8         Caracal        Super deals       Fair   82.405063  505.5
9            Sand  Watches unlimited        New   79.493671  510.0

### stack() and unstack()

![Img](https://miro.medium.com/max/1400/1*DYDOif_qBEgtWfFKUDSf0Q.png)

In [133]:
df_index = df.set_index(["model", "store", "condition"])
df_index

                                            engagement   price
model          store             condition
Caracal        Watches unlimited New         77.848101   489.0
               National traders  Like new    75.696203   489.0
                                 Good        72.025316   490.5
Lightning bolt Super deals       Like new    78.987342   501.0
Sand           Super deals       Good        80.126582   502.5
...                                                ...     ...
Lightning bolt National traders  Very Good   80.379747  4239.0
Sand           National traders  Good        80.506329  4282.5
Lightning bolt Watches unlimited Fair        67.088608  4284.0
Sand           Super deals       Like new    79.493671   835.5
Tempo          Watches unlimited Good        82.405063  4308.0

[75 rows x 2 columns]

In [135]:
unstacked = df_index.unstack()   #takes the last colum of indesex and convert it into a row as a title
unstacked

                                 engagement                                   \
condition                              Fair       Good   Like new        New
model          store
Caracal        National traders   69.746835  72.025316  75.696203  79.113924
               Super deals        82.405063  81.139241  76.202532  79.620253
               Watches unlimited  74.303797  72.784810  77.088608  77.848101
Clepsydra      National traders   83.164557  80.759494  77.848101  77.468354
               Super deals        81.518987  81.012658  77.468354  78.481013
               Watches unlimited  85.949367  79.873418  79.620253  77.974684
Lightning bolt National traders   86.202532  80.000000  79.113924  77.974684
               Super deals        85.189873  80.126582  78.987342  78.481013
               Watches unlimited  67.088608  80.886076  74.430380  77.468354
Sand           National traders   83.291139  80.506329  75.063291  78.734177
               Super deals        82.278481  80.126582  79.493671  77.341772
               Watches unlimited  83.164557  81.012658  78.354430  79.493671
Tempo          National traders   74.430380  82.405063  78.227848  77.974684
               Super deals        74.683544  75.569620  78.101266  78.354430
               Watches unlimited  69.746835  82.405063  77.088608  78.354430

                                              price                           \
condition                         Very Good    Fair    Good Like new     New
model          store
Caracal        National traders   79.240506  4135.5   490.5    489.0  4135.5
               Super deals        80.759494   505.5   603.0    517.5   831.0
               Watches unlimited  78.987342  4207.5  4138.5    517.5   489.0
Clepsydra      National traders   78.354430  4144.5   604.5   4140.0  4147.5
               Super deals        77.215190  4144.5   603.0    831.0  4144.5
               Watches unlimited  80.632911  4165.5   604.5    831.0  4195.5
Lightning bolt National traders   80.379747  4216.5   607.5    532.5   831.0
               Super deals        79.240506  4206.0   526.5    501.0   522.0
               Watches unlimited  78.860759  4284.0   831.0   4185.0   604.5
Sand           National traders   79.493671  4183.5  4282.5    607.5   516.0
               Super deals        79.367089  4222.5   502.5    835.5   604.5
               Watches unlimited  75.189873  4216.5  4233.0   4210.5   510.0
Tempo          National traders   76.455696  4195.5  4204.5    829.5  4140.0
               Super deals        75.822785  4200.0  4164.0   4140.0   606.0
               Watches unlimited  80.126582  4173.0  4308.0   4149.0  4149.0


condition                        Very Good
model          store
Caracal        National traders      831.0
               Super deals           528.0
               Watches unlimited    4138.5
Clepsydra      National traders      505.5
               Super deals           529.5
               Watches unlimited    4176.0
Lightning bolt National traders     4239.0
               Super deals           607.5
               Watches unlimited     504.0
Sand           National traders      504.0
               Super deals           526.5
               Watches unlimited     529.5
Tempo          National traders      531.0
               Super deals          4203.0
               Watches unlimited     829.5

In [137]:
unstacked.stack()

                                     engagement   price
model   store             condition
Caracal National traders  Fair        69.746835  4135.5
                          Good        72.025316   490.5
                          Like new    75.696203   489.0
                          New         79.113924  4135.5
                          Very Good   79.240506   831.0
...                                         ...     ...
Tempo   Watches unlimited Fair        69.746835  4173.0
                          Good        82.405063  4308.0
                          Like new    77.088608  4149.0
                          New         78.354430  4149.0
                          Very Good   80.126582   829.5

[75 rows x 2 columns]

# Practicing

In [143]:
titanic = pd.read_csv('Data/titanic.csv')

In [144]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [149]:
# Average age of men and female 
titanic.groupby(['Sex']).agg({'Age':'mean'})

              Age
Sex
female  27.915709
male    30.726645

In [150]:
# Average age of men and female that survived
titanic.groupby(['Sex','Survived']).agg({'Age':'mean'})

                       Age
Sex    Survived
female 0         25.046875
       1         28.847716
male   0         31.618056
       1         27.276022

In [153]:
# Average age of men and female that survived with Puvot Table
pd.pivot_table(titanic,values = ['Age'] , index = ['Sex'] , columns= ['Survived'])

                Age
Survived          0          1
Sex
female    25.046875  28.847716
male      31.618056  27.276022

In [155]:
# how many men and female survived with pivot_table
pd.pivot_table(titanic,values = ['Age'] , index = ['Sex'] , columns= ['Survived'],aggfunc="count")

          Age
Survived    0    1
Sex
female     64  197
male      360   93

In [158]:
# how many men and female survived with groupby
titanic.groupby(['Sex','Survived']).agg({'Age':'count'})

                 Age
Sex    Survived
female 0          64
       1         197
male   0         360
       1          93

In [160]:
# average age of male and femalo according to the class they travled in with groupby
titanic.groupby(['Sex','Survived','Pclass']).agg({"Age":'mean'})

                              Age
Sex    Survived Pclass
female 0        1       25.666667
                2       36.000000
                3       23.818182
       1        1       34.939024
                2       28.080882
                3       19.329787
male   0        1       44.581967
                2       33.369048
                3       27.255814
       1        1       36.248000
                2       16.022000
                3       22.274211

In [166]:
# average age of male and femalo according to the class they travled in with pivot_table
pd.pivot_table(titanic , values= "Age" , columns= ['Survived'] , index=['Sex','Pclass'],aggfunc='mean')

Survived               0          1
Sex    Pclass
female 1       25.666667  34.939024
       2       36.000000  28.080882
       3       23.818182  19.329787
male   1       44.581967  36.248000
       2       33.369048  16.022000
       3       27.255814  22.274211

In [168]:
# Average ticket price of the ones who survived compared to the ones that didn't with groupby
titanic.groupby(['Survived']).agg({'Fare':'mean'})

               Fare
Survived
0         22.117887
1         48.395408

In [175]:
# Average ticket price of the ones who survived compared to the ones that didn't with pivot_table
pd.pivot_table(data=titanic, values= 'Fare' , index='Survived',aggfunc='mean')

               Fare
Survived
0         22.117887
1         48.395408

In [178]:
#mean of the price of the ticket accordin to the class with pivot_table
pd.pivot_table(titanic, values= 'Fare' , index= 'Pclass', aggfunc = 'mean')

             Fare
Pclass
1       84.154687
2       20.662183
3       13.675550

In [180]:
#mean of the price of the ticket accordin to the class with groupby
titanic.groupby(['Pclass']).agg({'Fare':'mean'})

             Fare
Pclass
1       84.154687
2       20.662183
3       13.675550

In [185]:
#mean and count of the price of the ticket accordin to the class with groupby
titanic.groupby(['Pclass','Survived']).agg({'Fare':['mean','count']})

                      Fare
                      mean count
Pclass Survived
1      0         64.684007    80
       1         95.608029   136
2      0         19.412328    97
       1         22.055700    87
3      0         13.669364   372
       1         13.694887   119

In [184]:
#mean and count of the price of the ticket accordin to the class with pivot_table
pd.pivot_table(titanic, values= 'Fare' , index= 'Pclass', columns= 'Survived' , aggfunc = ['mean','count'])

               mean            count
Survived          0          1     0    1
Pclass
1         64.684007  95.608029    80  136
2         19.412328  22.055700    97   87
3         13.669364  13.694887   372  119